Show / Hide Table of Contents
Class GrpcReflectionServer
Instance of GrpcServer with Reflection Service added.
Inheritance
System.Object
GrpcService.GrpcServiceBase
GrpcServer
GrpcReflectionServer
Inherited Members
 GrpcServer.MessageReceived
 GrpcServer.ClientConnected
 GrpcServer.ClientDisconnected
 GrpcServer.IsConnected
 GrpcServer.Port
 GrpcServer.ClientID
 GrpcServer.Start()
 GrpcServer.RegisterHandler(String, IGrpcMessageHandler)
 GrpcServer.ConnectAsync(IAsyncStreamReader<GrpcMessage>, IServerStreamWriter<GrpcMessage>, ServerCallContext)
 GrpcServer.SendMessageAsync(String, String, String)
 GrpcServer.HandleMessageAsync(GrpcMessage)
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc.Reflection
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcReflectionServer : GrpcServer
Constructors
Improve this Doc   View Source
GrpcReflectionServer(Object, Int32)
Creates a grpc reflection service for specified instance.
Declaration
public GrpcReflectionServer(object instance, int port)
Parameters
 Type |  Name |  Description
 System.Object |  instance
Instance targeted by reflection calls.
 System.Int32 |  port
Port on which server will run.
 Improve this Doc
 View Source